{"config": [{"config": {"kernel_constraint": null, "dtype": "float32", "padding": "same", "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "bias_regularizer": null, "name": "conv2d_5", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_6", "padding": "same", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_4", "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_7", "padding": "same", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_8", "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_5", "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_6", "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}